tf11_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:Action>AcceptDocument</wsa:Action>
    <wsa:MessageID>urn:uuid:dd6bcb9a-a1e6-461c-979a-d42a788df542</wsa:MessageID>
    <wsa:To>https://te-ws.puesc.gov.pl/seap_wsChannel/DocumentHandlingPort</wsa:To>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>rtbtrt6@gmail.com</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">0Lw5rmZUgR5wfkxZhsV3FcOZD4o=</wsse:Password>
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">Iw8qwD/+PvbdLzr2qLgM7w==</wsse:Nonce>
        <wsu:Created xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2022-09-21T07:08:15+00:00</wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </soap-env:Header>
  <soap-env:Body>
    <ns0:AcceptDocumentRequest xmlns:ns0="http://www.mf.gov.pl/uslugiBiznesowe/WsPull/Usluga/2014/01_v2_0">
      <ns1:document xmlns:ns1="http://www.mf.gov.pl/schematy/SISC/WsChannel/2014/01_v2_0">
        <ns1:content filename="taxfree.xml" mime="application/xml">PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPHRuczpQb3R3aWVyZHplbmllV3l3b3p1IHhtbG5zOnRucz0iaHR0cDovL3RheGZyZWUuZ292LnBsL3RmMTEiIHhtbG5zOnRuczE9Imh0dHA6Ly90YXhmcmVlLmdvdi5wbC90ZnR5cGVzLyIgeG1sbnM6eHNpPSJodHRwOi8vd3d3LnczLm9yZy8yMDAxL1hNTFNjaGVtYS1pbnN0YW5jZSIgeHNpOnNjaGVtYUxvY2F0aW9uPSJodHRwOi8vdGF4ZnJlZS5nb3YucGwvdGYxMSI+CiAgPHRuczpOdW1lclVOUz4yMVBMMDBURjAwMDEyMzQ1NjwvdG5zOk51bWVyVU5TPgogIDx0bnM6RGF0YVp3cm90dT4yMDIxLTAxLTIwPC90bnM6RGF0YVp3cm90dT4KICA8dG5zOkt3b3RhWndyb3R1PjQuNjA8L3RuczpLd290YVp3cm90dT4KICA8dG5zOlBhbnN0d29VRT5QTDwvdG5zOlBhbnN0d29VRT4KICA8dG5zOkRhdGFXeXdvenU+MjAyMS0wMS0xNTwvdG5zOkRhdGFXeXdvenU+CjwvdG5zOlBvdHdpZXJkemVuaWVXeXdvenU+Cg==</ns1:content>
        <ns1:targetSystems>
          <ns1:system>TAX FREE</ns1:system>
        </ns1:targetSystems>
      </ns1:document>
    </ns0:AcceptDocumentRequest>
  </soap-env:Body>
</soap-env:Envelope>
